tests/tools/artillery/stressTests/static_serving/mongodb.itemId.yml
config:
  target: 'http://0.0.0.0:3000'
  payload:
    # path is relative to the location of the test script
    path: '../../dbSample.csv'
    fields:
      - 'itemId'
      - 'itemName'
  http:
    pool: 10
  phases:
    - duration: 60
      arrivalRate: 200
      name: 'Warm up server'
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
      - get:
          url: '/items/{{itemId}}'